{
  "blogs": [
    {
      "title": "Amazon-owned Twitch bans Amazon account after breast revealed on air",
      "content": "Amazon-owned livestreaming site Twitch has banned an Amazon Prime Video channel after a presenter appeared to accidentally reveal her breast during a live show.\n\nThe official Spanish-language Prime Video channel was suspended from Twitch on Sunday, with no public reason given.\n\nHowever, it followed a segment on the talk show Esto es un Late where the incident took place.\n\nTwitch has strict rules around partial or full nudity on camera.\n\n\"For those who present as women, we ask that you cover your nipples. We do not permit exposed underbust,\" the service's community guidelines say.\n\nIt also does not permit \"sexually suggestive content\" such as a camera focus on \"breasts, buttocks, or pelvic region\".\n\nThe Esto es un Late hosts were at the end of their weekend stream when one of them - comedian Henar Alvarez - lifted up her shirt partway, apparently joking that it was one way to end the hours-long broadcast.\n\n\"We're about to be banned,\" she said laughing. \"Come on. They're going to ban us!\"\n\nThe stream then cut to a title card for a moment - but then returned to the live feed a split-second before Ms Alvarez's breast vanished from view.\n\nThe stream quickly ended - but within a few hours, the channel was banned from Twitch.\n\nAnother of the co-hosts - Mister Jagger - tweeted afterwards that Esto es un Late is the \"best programme in the world\".\n\nGamer loses work because of her Squid Game name\nTwitch apologises for using 'womxn' after backlash\nTwitch 'hot tub streamer' has ads pulled\nGaming news site Kotaku reports that it is the first time an Amazon-owned brand has been banned from Twitch.\n\nIt is not clear for how long Prime Video Espana's suspension will last. Twitch does not, generally, make the details of disciplinary action public, and bans can vary in length.\n\nThe livestreaming giant also has an appeals process for those looking to have a ban lifted or shortened.\n\nTwitch, which started as a video game streaming site but has transformed into an all-purpose platform, has had several problems over the years with sexually suggestive content.\n\nIn the past, women who dressed in a way that some considered suggestive were derisively referred to as \"booby streamers\" by critics. That led to a 2018 revision of the \"dress code\".\n\nMore recently, the emergence of the \"hot tub meta\" - where streamers would broadcast in swimwear from an indoor hot tub - raised similar questions about what is and is not allowed.\n\nEarlier this year, one of the biggest such streamers on Twitch, Amouranth, had advertising revenue pulled from her account - even though she argued she had not broken any rules.\n\n",
      "author": "Rustam",
      "likes": 30,
      "id": 1
    },
    {
      "title": "Interstellar probe: A mission for the generations",
      "content": "Imagine working on a project you know you have no hope of seeing through to completion. Would you have the motivation to even get it going?\n\nAbsolutely, says Ralph McNutt from Johns Hopkins University Applied Physics Laboratory (JHU-APL) in the US.\n\nMcNutt, with colleagues, has just published a detailed report that envisions a long-lived interstellar probe - a mission to the space between the stars.\n\nNasa's legendary Voyagers are travelling through this domain right now, but McNutt's probe would go further and faster and would expect still to be working 50-100 years after leaving Earth.\n\n\"Suppose this thing launched in 2036, and it got to the end of the nominal mission in 2086,\" he pondered. \"That puts me at about 130 years old. I'm not going to worry about it. You have to hand these things off. I say to people, 'if you're into instant gratification, do not get involved with space exploration'.\"",
      "author": "Gulnaz",
      "likes": 50,
      "id": 2
    },
    {
      "title": "Intel apologises to China over supplier advice",
      "content": "US microchip maker Intel has apologised following a backlash over its letter urging suppliers not to source products or labour from China's Xinjiang region.\n\nThe company's letter sparked criticism in China, with calls for a boycott.\n\nThe letter said Intel had been \"required to ensure\" its supply chain did not use labour or source goods from Xinjiang, following restrictions imposed by \"multiple governments\".\n\nChina has been accused of human rights abuses in Xinjiang.\n\nThe region is home to many of country's Muslim Uyghur population and there have been allegations of forced labour and possibly genocide.\n\nIn December last year, the BBC published an investigation based on new research showing China was forcing hundreds of thousands of minorities, including Uyghurs, into manual labour in Xinjiang's cotton fields.\n\nBeijing has repeatedly denied the claims.\n\nWho are the Uyghurs and why is China being accused of genocide?\nCan Western brands recover in China after backlash?\nWestern states sanction China for Uighur 'abuses'\nIn a Chinese-language statement on its official WeChat and Weibo accounts, Intel said that its commitment to avoid supply chains from Xinjiang was an expression of compliance with US law, rather than a statement of its position on the issue.\n\n\"We apologise for the trouble caused to our respected Chinese customers, partners and the public. Intel is committed to becoming a trusted technology partner and accelerating joint development with China,\" the firm said.\n\nThe White House said President Joe Biden signed into a law a bill that requires companies to prove that goods imported from China's Xinjiang region have not been produced with forced labour.\n\nThe bill was passed by Congress last week with the aim of stopping US companies from benefitting from forced labour, something which China denies is the case.\n\nMany Weibo users derided Intel's apology as an attempt at protecting sales in China, with one saying: \"A mistake is a mistake! Retract the statement about Xinjiang!\"\n\nMeanwhile, the hashtag \"Is Intel's apology sincere?\" was trending on Weibo on Thursday, Reuters reported.\n\nSinger Karry Wang said he would no longer serve as brand ambassador for Intel, adding in a statement that \"national interests exceed everything\".\n\nIntel is not the first company to come under pressure over aims to comply with sanctions related to Xinjiang while continuing to operate in China.",
      "author": "Gulnaz",
      "id": 3
    }
  ]
}