import React from 'react';
import './Blog.css'

const Blog = (props) => (
    <div className="Blog">
       <p>
       Портфолио — это презентация себя, как специалиста. От качества материала
        из которого оно составлено будет зависеть количество заказов, которые
        заказчик будет готов вам отдать. Поэтому стоит подобрать работы,
        выполненные на высоком уровне и достаточно разноплановые.
        Вам понадобятся Ваши работы. Желательно, демонстрирующие
        профессиональные навыки соискателя с разных сторон и выполненные на
        хорошем уровне.
        В первую очередь стоит обратить внимание на грамотность. Даже
        качественно сделанное, хорошо подобранное и скомпонованное портфолио
        не понравится работодателю, если в комментариях к своим работам вы
        будете допускать ошибки. И не имеет значения, опечатка это или
        грамматическая ошибка.
       </p>
    </div>
)
export default Blog;